Revit 2027 API
BuiltInFailures.CreationFailures.CannotDrawRoofError Property
 Can't make roof.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CannotDrawRoofError { get; }
Public Shared ReadOnly Property CannotDrawRoofError As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CannotDrawRoofError {
	FailureDefinitionId^ get ();
}
static member CannotDrawRoofError : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.CreationFailures Class
Autodesk.Revit.DB Namespace